tutorials/incompressible/pimpleSolver/laminar/ACCM_circularCylinder/system/controlDict
/*-------------------------------------------------------------------------------*
Caelus 8.04
Web:   www.caelus-cml.com
\*------------------------------------------------------------------------------*/

FoamFile
{
	version				2.0;
	format				ascii;
	class				dictionary;
	location			"system";
	object				controlDict;
}

//--------------------------------------------------------------------------------

application				pimpleSolver;

startFrom				startTime;

startTime				0;

stopAt					endTime;

endTime					360;

deltaT					0.01;

writeControl				runTime;

writeInterval				1;

purgeWrite				0;

writeFormat				ascii;

writePrecision				6;

writeCompression			uncompressed;

timeFormat				general;

timePrecision				6;

runTimeModifiable			true;

//-------------------------------------------------------------------------------

// Function Objects to obtain mean values

functions
{
	forces
	{
	type				forces;
        functionObjectLibs		("libforces.so");
        patches     			( wall );
        CofR      			(0 0 0);
        rhoName         		rhoInf;
        rhoInf          		1;
        outputControl   		timeStep;
        outputInterval  		50;
     }
}
//------------------------------------------------------------------------------


