tutorials/incompressible/pimpleSolver/laminar/ACCM_circularCylinder/0/U
/*-------------------------------------------------------------------------------*
Caelus 8.04
Web:   www.caelus-cml.com
\*-------------------------------------------------------------------------------*/

FoamFile
{
	version				2.0;
	format				ascii;
	class				volVectorField;
	object				U;
}

//--------------------------------------------------------------------------------

dimensions				[0 1 -1 0 0 0 0];

internalField				uniform (1.0 0 0);

boundaryField
{
	inlet-1
	{
		type			fixedValue;
		value			uniform (1.0 0 0);
	}
	inlet-2
	{
		type			fixedValue;
		value			uniform (1.0 0 0);
	}
	outlet
	{
		type			zeroGradient;
	}
	symmetry
	{
		type			empty;
	}
	wall
	{
		type			fixedValue;
		value			uniform (0 0 0);
	}
}
