tutorials/incompressible/pimpleSolver/laminar/ACCM_circularCylinder/0/p
/*-------------------------------------------------------------------------------*
Caelus 8.04
Web:   www.caelus-cml.com
\*------------------------------------------------------------------------------*/

FoamFile
{
	version				2.0;
	format				ascii;
	class				volScalarField;
	object				p;
}

//--------------------------------------------------------------------------------

dimensions				[0 2 -2 0 0 0 0];

internalField				uniform 0;

boundaryField
{
	inlet-1
	{
		type			zeroGradient;
	}
	inlet-2
	{
		type			zeroGradient;
	}
	outlet
	{
		type			fixedValue;
		value			uniform 0;
	}
	symmetry
	{
		type			empty;
	}
	wall
	{
		type			zeroGradient;
	}
}
